Revit 2027 API
Railing.GetHandRails Method
 Get all the handrails of the railing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetHandRails()
Public Function GetHandRails As IList(Of ElementId)
public:
IList<ElementId^>^ GetHandRails()
member GetHandRails : unit -> IList<ElementId>
Return Value
IList<ElementId>
 All handrails of the railing.
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace